app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "ertrtttter"], ["description", "ertrertetetetetr"], ["created_at", "2017-08-18 09:09:00.080086"], ["updated_at", "2017-08-18 09:09:00.080086"]]
---
  def create

  	@article = Article.new(params.require(:article).permit(:title, :description))
  	#@article.save
    #redirect_to @article


     if @article.save